## Flight Price Prediction(EDA + Feature Engineering)

In [1]:
# importing basic libraries

In [158]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline #donot need to write plt.show() for showing the plot hare

UsageError: unrecognized arguments: #donot need to write plt.show() for showing the plot hare

In [159]:
train_df=pd.read_excel('Data_Train.xlsx')

In [160]:
train_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662

In [161]:
test_df=pd.read_excel('Test_set.xlsx')

In [162]:
test_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info

In [163]:
df=train_df.append(test_df)
df.tail()

,Additional_Info,Airline,Arrival_Time,Date_of_Journey,Dep_Time,Destination,Duration,Price,Route,Source,Total_Stops
2666,No info,Air India,20:25 07 Jun,6/06/2019,20:30,Banglore,23h 55m,NaN,CCU → DEL → BLR,Kolkata,1 stop
2667,No info,IndiGo,16:55,27/03/2019,14:20,Banglore,2h 35m,NaN,CCU → BLR,Kolkata,non-stop
2668,No info,Jet Airways,04:25 07 Mar,6/03/2019,21:50,Cochin,6h 35m,NaN,DEL → BOM → COK,Delhi,1 stop
2669,No info,Air India,19:15,6/03/2019,04:00,Cochin,15h 15m,NaN,DEL → BOM → COK,Delhi,1 stop
2670,No info,Multiple carriers,19:15,15/06/2019,04:55,Cochin,14h 20m,NaN,DEL → BOM → COK,Delhi,1 stop

In [164]:
df.info(
)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 11 columns):
Additional_Info    13354 non-null object
Airline            13354 non-null object
Arrival_Time       13354 non-null object
Date_of_Journey    13354 non-null object
Dep_Time           13354 non-null object
Destination        13354 non-null object
Duration           13354 non-null object
Price              10683 non-null float64
Route              13353 non-null object
Source             13354 non-null object
Total_Stops        13353 non-null object
dtypes: float64(1), object(10)
memory usage: 1.2+ MB

In [165]:
# feature Engineering Process
df['Date']=df['Date_of_Journey'].str.split('/').str[0]
df['Month']=df['Date_of_Journey'].str.split('/').str[1]
df['Year']=df['Date_of_Journey'].str.split('/').str[2]

In [166]:
df.head(2)

,Additional_Info,Airline,Arrival_Time,Date_of_Journey,Dep_Time,Destination,Duration,Price,Route,Source,Total_Stops,Date,Month,Year
0,No info,IndiGo,01:10 22 Mar,24/03/2019,22:20,New Delhi,2h 50m,3897.0,BLR → DEL,Banglore,non-stop,24,03,2019
1,No info,Air India,13:15,1/05/2019,05:50,Banglore,7h 25m,7662.0,CCU → IXR → BBI → BLR,Kolkata,2 stops,1,05,2019

In [167]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
Additional_Info    13354 non-null object
Airline            13354 non-null object
Arrival_Time       13354 non-null object
Date_of_Journey    13354 non-null object
Dep_Time           13354 non-null object
Destination        13354 non-null object
Duration           13354 non-null object
Price              10683 non-null float64
Route              13353 non-null object
Source             13354 non-null object
Total_Stops        13353 non-null object
Date               13354 non-null object
Month              13354 non-null object
Year               13354 non-null object
dtypes: float64(1), object(13)
memory usage: 1.5+ MB

In [168]:
df['Date']=df['Date'].astype(int)
df['Month']=df['Month'].astype(int)
df['Year']=df['Year'].astype(int)

In [169]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
Additional_Info    13354 non-null object
Airline            13354 non-null object
Arrival_Time       13354 non-null object
Date_of_Journey    13354 non-null object
Dep_Time           13354 non-null object
Destination        13354 non-null object
Duration           13354 non-null object
Price              10683 non-null float64
Route              13353 non-null object
Source             13354 non-null object
Total_Stops        13353 non-null object
Date               13354 non-null int32
Month              13354 non-null int32
Year               13354 non-null int32
dtypes: float64(1), int32(3), object(10)
memory usage: 1.4+ MB

In [170]:
df.drop('Date_of_Journey',axis=1,inplace=True)

In [171]:
df.head(1)

,Additional_Info,Airline,Arrival_Time,Dep_Time,Destination,Duration,Price,Route,Source,Total_Stops,Date,Month,Year
0,No info,IndiGo,01:10 22 Mar,22:20,New Delhi,2h 50m,3897.0,BLR → DEL,Banglore,non-stop,24,3,2019

In [172]:
df.isnull().sum()

Additional_Info       0
Airline               0
Arrival_Time          0
Dep_Time              0
Destination           0
Duration              0
Price              2671
Route                 1
Source                0
Total_Stops           1
Date                  0
Month                 0
Year                  0
dtype: int64

In [173]:
df['Arrival_Time']=df['Arrival_Time'].apply(lambda x : x.split(' ')[0])

In [174]:
df['Arrival_Hour']=df['Arrival_Time'].str.split(':').str[0]

In [175]:
df['Arrival_Minute']=df['Arrival_Time'].str.split(':').str[1]

In [176]:
df['Arrival_Hour']=df['Arrival_Hour'].astype(int)
df['Arrival_Minute']=df['Arrival_Minute'].astype(int)

In [177]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 15 columns):
Additional_Info    13354 non-null object
Airline            13354 non-null object
Arrival_Time       13354 non-null object
Dep_Time           13354 non-null object
Destination        13354 non-null object
Duration           13354 non-null object
Price              10683 non-null float64
Route              13353 non-null object
Source             13354 non-null object
Total_Stops        13353 non-null object
Date               13354 non-null int32
Month              13354 non-null int32
Year               13354 non-null int32
Arrival_Hour       13354 non-null int32
Arrival_Minute     13354 non-null int32
dtypes: float64(1), int32(5), object(9)
memory usage: 1.4+ MB

In [178]:
df.drop('Arrival_Time',axis=1,inplace=True)

In [179]:
df.head(2)

,Additional_Info,Airline,Dep_Time,Destination,Duration,Price,Route,Source,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute
0,No info,IndiGo,22:20,New Delhi,2h 50m,3897.0,BLR → DEL,Banglore,non-stop,24,3,2019,1,10
1,No info,Air India,05:50,Banglore,7h 25m,7662.0,CCU → IXR → BBI → BLR,Kolkata,2 stops,1,5,2019,13,15

In [180]:
df['Dep_Hour']=df['Dep_Time'].str.split(':').str[0]
df['Dep_Hour']=df['Dep_Hour'].astype(int)

In [181]:
df['Dep_Minute']=df['Dep_Time'].str.split(':').str[0]
df['Dep_Minute']=df['Dep_Minute'].astype(int)

In [182]:
df.drop('Dep_Time',axis=1,inplace=True)

In [183]:
df.head(3)

,Additional_Info,Airline,Destination,Duration,Price,Route,Source,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute
0,No info,IndiGo,New Delhi,2h 50m,3897.0,BLR → DEL,Banglore,non-stop,24,3,2019,1,10,22,22
1,No info,Air India,Banglore,7h 25m,7662.0,CCU → IXR → BBI → BLR,Kolkata,2 stops,1,5,2019,13,15,5,5
2,No info,Jet Airways,Cochin,19h,13882.0,DEL → LKO → BOM → COK,Delhi,2 stops,9,6,2019,4,25,9,9

In [184]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [185]:
df['Total_Stops'].isnull().sum()

1

In [194]:
df['Total_Stops']=pd.get_dummies(df['Total_Stops'],drop_first=True)
#df['Total_Stops']=df['Total_Stops'].map({'non-stop':0,'1 stop':1,'2 stop':2,'3 stop':3,'4 stop':4,'nan':1})

In [195]:
#df.drop('Route',axis=1,inplace=True)

In [196]:
df.head(2)

,Additional_Info,Airline,Destination,Duration,Price,Source,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute
0,No info,IndiGo,New Delhi,2h 50m,3897.0,Banglore,0,24,3,2019,1,10,22,22
1,No info,Air India,Banglore,7h 25m,7662.0,Kolkata,1,1,5,2019,13,15,5,5

In [113]:
df['Additional_Info'].unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [114]:
df['Duration_hour']=df['Duration'].str.split(' ').str[0].str.split('h').str[0]

In [115]:
df[df['Duration_hour']=='5m']

,Additional_Info,Airline,Destination,Duration,Price,Source,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,Duration_hour
6474,No info,Air India,Hyderabad,5m,17327.0,Mumbai,NaN,6,3,2019,16,55,16,16,5m
2660,No info,Air India,Hyderabad,5m,NaN,Mumbai,NaN,12,3,2019,16,55,16,16,5m

In [116]:
df.drop(6474,axis=0,inplace=True)

In [117]:
df.drop(2660,axis=0,inplace=True)

In [118]:
df['Duration_minute']=df['Duration'].str.split('h').str[1].str.split('m').str[0]

In [119]:
df.head(2)

,Additional_Info,Airline,Destination,Duration,Price,Source,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,Duration_hour,Duration_minute
0,No info,IndiGo,New Delhi,2h 50m,3897.0,Banglore,0.0,24,3,2019,1,10,22,22,2,50
1,No info,Air India,Banglore,7h 25m,7662.0,Kolkata,NaN,1,5,2019,13,15,5,5,7,25

In [120]:
df.drop('Duration',axis=1,inplace=True)

In [121]:
df.head(2)

,Additional_Info,Airline,Destination,Price,Source,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,Duration_hour,Duration_minute
0,No info,IndiGo,New Delhi,3897.0,Banglore,0.0,24,3,2019,1,10,22,22,2,50
1,No info,Air India,Banglore,7662.0,Kolkata,NaN,1,5,2019,13,15,5,5,7,25

In [122]:
df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [123]:
from sklearn.preprocessing import LabelEncoder
label_encoder=LabelEncoder()
df['Airline']=label_encoder.fit_transform(df['Airline'])
df['Additional_Info']=label_encoder.fit_transform(df['Additional_Info'])
df['Destination']=label_encoder.fit_transform(df['Destination'])
df['Source']=label_encoder.fit_transform(df['Source'])

In [ ]:
#Or we can do one hot encoding also
from sklearn.preprocessing import OneHotEncoder
OHE=OneHotEncoder()
df['Airline']=OHE.fit_transform(df['Airline'])
df['Additional_Info']=OHE.fit_transform(df['Additional_Info'])
df['Destination']=OHE.fit_transform(df['Destination'])
df['Source']=OHE.fit_transform(df['Source'])

In [124]:
df.head(2)

,Additional_Info,Airline,Destination,Price,Source,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,Duration_hour,Duration_minute
0,8,3,5,3897.0,0,0.0,24,3,2019,1,10,22,22,2,50
1,8,1,0,7662.0,3,NaN,1,5,2019,13,15,5,5,7,25

In [201]:
pd.get_dummies(df,columns=['Airline','Destination','Additional_Info','Source'],drop_first=True).head(2)

,Duration,Price,Total_Stops,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,...,Additional_Info_Change airports,Additional_Info_In-flight meal not included,Additional_Info_No Info,Additional_Info_No check-in baggage included,Additional_Info_No info,Additional_Info_Red-eye flight,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai
0,2h 50m,3897.0,0,24,3,2019,1,10,22,22,...,0,0,0,0,1,0,0,0,0,0
1,7h 25m,7662.0,1,1,5,2019,13,15,5,5,...,0,0,0,0,1,0,0,0,1,0

In [202]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
Additional_Info    13354 non-null object
Airline            13354 non-null object
Destination        13354 non-null object
Duration           13354 non-null object
Price              10683 non-null float64
Source             13354 non-null object
Total_Stops        13354 non-null uint8
Date               13354 non-null int32
Month              13354 non-null int32
Year               13354 non-null int32
Arrival_Hour       13354 non-null int32
Arrival_Minute     13354 non-null int32
Dep_Hour           13354 non-null int32
Dep_Minute         13354 non-null int32
dtypes: float64(1), int32(7), object(5), uint8(1)
memory usage: 1.1+ MB